Documents/ЗадачаСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗадачаСотрудника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадачи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеСтроковаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТегиЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЗаписиКалендаряСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЗаписиКалендаряСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаписейКалендаря</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Comment>Для связи со строкой табличной части источника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеЗапрещено</Name>
					<Comment>Запрет интерактивного редактирования записи в планировщике</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьETag</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗадачаСотрудника/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДатыНачалаОкончанияНаФорме(ЭтотОбъект);
		ТегированиеОбъектов.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект, Объект);
		Действие = "Создание";
	Иначе
		Действие = "Изменение";
	КонецЕсли;
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ЗаполнитьВыборДатыНачала();
	ЗаполнитьВыборОтветственногоИзОснования();
	ЗаполнитьСписокОснований();
	
	Элементы.Автор.Видимость = ЗначениеЗаполнено(Объект.Автор)
		И Объект.Автор <> Пользователи.АвторизованныйПользователь();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Документ_ЗадачаСотрудника = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ЗадачаСотрудника");
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	ПараметрыРазмещения = НапоминанияПользователя.ПараметрыРазмещения();
	ПараметрыРазмещения.Группа = Элементы.ГруппаНапоминания;
	ПараметрыРазмещения.ИмяРеквизитаСДатойСобытия = "ДатаНачала";
	НапоминанияПользователя.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПриСозданииНаСервере();
	
	НачальноеЗначениеДатаНачала = Объект.ДатаНачала;
	НачальноеЗначениеДатаОкончания = Объект.ДатаОкончания;
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	НайтиВремяВидимость = НЕ ЗначениеЗаполнено(Параметры.Свойство("СозданиеЗадачиКонтактЦентр")) ИЛИ НЕ Параметры.Свойство("СозданиеЗадачиКонтактЦентр");
	
	СистемаВзаимодействияПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	ОткрытьФормуМодально = Объект.Ссылка.Пустая() 
		Или ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОткрытьМодально", Ложь) Или Не СистемаВзаимодействияПодключена;
		
	Если ОткрытьФормуМодально Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;	
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторФормыИсточника") Тогда
		ИдентификаторФормыИсточника = Параметры.ИдентификаторФормыИсточника;
	КонецЕсли;
	
	Элементы.ФормаОбсуждение.Видимость = ОткрытьФормуМодально И СистемаВзаимодействияПодключена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Поиск модальных окон документа
	ОкноИсточникаФормы = ОкноИсточникаФормыДокумента(Объект.Ссылка);
	Если ОкноИсточникаФормы <> Неопределено Тогда
		Закрыть();
		ОкноИсточникаФормы.Активизировать();
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьОснованиеНаФорме();
	УправлениеФормой();
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийЭлемент = Элементы.Описание;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Функция ОкноИсточникаФормыДокумента(Документ)

	Если Документ.Пустая()  Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОткрытыеОкна = ПолучитьОкна(); 

	// Поиск открытых модально форм документа
	
	ИдентификаторОкнаИсточника = Неопределено;  
	
	Для каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
			
		Для каждого ФормаОкна Из ОткрытоеОкно.Содержимое Цикл
			
			РеквизитОбъектНайден = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОкна, "Объект");
			СсылкаНаДокумент = Неопределено;
			
			Если ПустаяСтрока(ИдентификаторОкнаИсточника) И РеквизитОбъектНайден Тогда
				
				ФормаОкна.Объект.Свойство("Ссылка", СсылкаНаДокумент);
				
				Если СсылкаНаДокумент = Документ И ФормаОкна.ОткрытьФормуМодально И ФормаОкна.ИмяФормы = ИмяФормы Тогда
					ИдентификаторОкнаИсточника = ФормаОкна.ИдентификаторФормыИсточника; 
					Прервать;
				КонецЕсли;
				
			КонецЕсли;   
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Если ИдентификаторОкнаИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Поиск окна формы источника
	
	Для каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
		Для каждого ФормаОкна Из ОткрытоеОкно.Содержимое Цикл
			Если Строка(ФормаОкна.УникальныйИдентификатор) = ИдентификаторОкнаИсточника Тогда
				Возврат ФормаОкна;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаполнитьДатыНачалаОкончанияНаФорме(ЭтотОбъект);
	ТегированиеОбъектов.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПользователя.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТегированиеОбъектов.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПользователя.ПриЗаписиНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанныеЗадачПоОснованию(ТекущийОбъект);
	
	// Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения

	// Уведомления
	УведомлениеОбИзмененииОбъектов.ПослеЗаписиНаСервере(ТекущийОбъект);
	// Конец Уведомления
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);

	Оповестить("Запись_ЗадачаСотрудника", Объект.Ссылка, ЭтотОбъект);
	ПоказатьОповещениеПослеЗаписиЗадачи();	
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПользователяКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ЗакрыватьПриВыборе Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого ВыбранноеОснование Из ВыбранноеЗначение Цикл
			НоваяСтрока = СписокОснований.Добавить();
			НоваяСтрока.Основание = ВыбранноеОснование;
		КонецЦикла;
	Иначе
		НоваяСтрока = СписокОснований.Добавить();
		НоваяСтрока.Основание = ВыбранноеЗначение;
	КонецЕсли;
		
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	СкорректироватьДатуНачалаИОкончания(Элемент);
	СместитьДатуОкончанияАвтоматическиПриИзменении(Элемент);
	ЗаполнитьДатыНачалаОкончанияВОбъекте(ЭтотОбъект);
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ВремяНачала) И Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДата;
	КонецЕсли;
	СкорректироватьДатуНачалаИОкончания(Элемент);
	ЗаполнитьДатыНачалаОкончанияВОбъекте(ЭтотОбъект);
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	
	СкорректироватьДатуНачалаИОкончания(Элемент);
	ЗаполнитьДатыНачалаОкончанияВОбъекте(ЭтотОбъект);
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	СкорректироватьДатуНачалаИОкончания(Элемент);
	ЗаполнитьДатыНачалаОкончанияВОбъекте(ЭтотОбъект);
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесьДеньПриИзменении(Элемент)
	ПриИзмененииВесьДеньДляЗадачиСотрудника();
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СместитьДатуОкончанияАвтоматическиПриИзменении(Элемент)
	
	ЗависимыеЭлементы = Новый Соответствие;
	ЗависимыеЭлементы.Вставить("ДатаНачала", "ДатаОкончания");
	ЗависимыеЭлементы.Вставить("ВремяНачала", "ВремяОкончания");
	
	ИзмененныйРеквизит = Элемент.Имя;
	ИзменяемыйРеквизит = ЗависимыеЭлементы.Получить(ИзмененныйРеквизит);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИзменяемыйРеквизит]) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект[ИзмененныйРеквизит] >= ЭтотОбъект[ИзменяемыйРеквизит] Тогда
		ЭтотОбъект[ИзменяемыйРеквизит] = ЭтотОбъект[ИзмененныйРеквизит] + (Объект.ДатаОкончания - Объект.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьДатуНачалаИОкончания(Элемент)
	
	ДатаВремяНачало = ?(ДатаНачала = Дата(1,1,1),ДатаНачала, ДатаНачала + (ВремяНачала - НачалоДня(ВремяНачала)));
	ДатаВремяОкончание = ДатаОкончания + (ВремяОкончания - НачалоДня(ВремяОкончания));
	
	РаботаСКалендаремКлиент.СкорректироватьДатуНачалаИОкончания(
		ДатаВремяНачало,
		ДатаВремяОкончание,
		Объект.ВесьДень,
		НачальноеЗначениеДатаНачала,
		НачальноеЗначениеДатаОкончания,,,,,
		Истина);
		
	ДатаНачала = НачалоДня(ДатаВремяНачало);
	ВремяНачала = Дата(1,1,1) + (ДатаВремяНачало - НачалоДня(ДатаВремяНачало));
	ВремяОкончания = Дата(1,1,1) + (ДатаВремяОкончание - НачалоДня(ДатаВремяОкончание));
	ДатаОкончания = НачалоДня(ДатаВремяОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаТегаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПолеВводаТегаОбработкаВыбораСервер(Элемент.Имя, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ТекущийЭлемент = Элементы.ОблакоТегов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаТегаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПолеВводаТегаОкончаниеВводаТекстаСервер(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ТекущийЭлемент = Элементы.ОблакоТегов;
	
КонецПроцедуры

&НаКлиенте
Процедура ОблакоТеговОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОблакоТеговОбработкаНавигационнойСсылкиСервер(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ЗаполнитьКалендарьПоОтветственному();
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	ЗаполнитьКолонкуКалендаря();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОчиститьСписокОснованийНажатие(Элемент)
	СписокОснований.Очистить();
	ОчиститьОснованиеЗадачи();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодобратьНажатие(Элемент)
	ВыбратьТипОснованияЗадачиИзСписка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокОснованийПослеУдаления(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьДатуИзКалендаря(Команда)
	
	НачатьВыборДатыИзКалендаря();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДопРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Документ_ЗадачаСотрудника);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗаписатьИЗакрытьЗадачу(Команда)
	ПроверкаВремени();
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура Обсуждение(Команда)
	
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru='Документ будет записан. Продолжить?'");
		ТекстЗаголовка = НСтр("ru='Обсуждения'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьОбсуждениеПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, 
			ТекстЗаголовка);
			
		Возврат;

	КонецЕсли;
	
	ОткрытьКонтекстноеОбсуждение(Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьОбсуждениеПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ФормаЗаписатьИЗакрытьЗадачу(Неопределено);
	
	ОткрытьКонтекстноеОбсуждение(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтекстноеОбсуждение(ФормаОткрыта)
	
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылкаОбсуждения = НавигационнаяСсылкаОбсуждения(Объект.Ссылка);
	
	Если ФормаОткрыта Тогда
		Закрыть();	
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаОбсуждения);

КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаОбсуждения(Знач Контекст)
	
	КонтекстноеОбсуждение = ОбсужденияУНФ.ПолучитьКонтекстноеОбсуждение(Контекст);
	
	Возврат ПолучитьНавигационнуюСсылку(КонтекстноеОбсуждение);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОповещениеПослеЗаписиЗадачи()
	
	Если СписокОснований.Количество() <> 0 Тогда
		
		ШаблонСтроки = НСтр("ru=';%1 задача;;%1 задачи;%1 задач;%1 задачи'");
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='%1: '"),Действие),,
			СтрШаблон(НСтр("ru='%1 '"), СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ШаблонСтроки,СписокОснований.Количество()))
			,БиблиотекаКартинок.Информация32,,СтатусОповещенияПользователя.Информация);
	Иначе
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='%1:'"),Действие),ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			СтрШаблон(НСтр("ru='%1 '"), Строка(Объект.Ссылка))
			,БиблиотекаКартинок.Информация32,,СтатусОповещенияПользователя.Информация);
			
	КонецЕсли;
		
	Действие = "Изменение";
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеЗадачПоОснованию(ТекущийОбъект)
	
	Для Каждого Основание Из СписокОснований Цикл
		
		Если Основание.Основание = ТекущийОбъект.Основание Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Основание.Задача) Тогда
			НоваяЗадача = Документы.ЗадачаСотрудника.СоздатьДокумент();
			НоваяЗадача.Заполнить(Неопределено);
			Действие = "Создание";
		Иначе
			НоваяЗадача = Основание.Задача.ПолучитьОбъект();
			Действие = "Изменение";
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НоваяЗадача,ТекущийОбъект,,"Ссылка,Номер,Дата,ПометкаУдаления,Проведен");
		НоваяЗадача.Основание = Основание.Основание;
		НоваяЗадача.ОснованиеСтроковаяСсылка = Неопределено;
		НоваяЗадача.ОснованиеПредставление = Неопределено;
		
		НоваяЗадача.Теги.Очистить();
		НоваяЗадача.Теги.Загрузить(ТекущийОбъект.Теги.Выгрузить());		
		НоваяЗадача.Записать();
		
		Основание.Задача = НоваяЗадача.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	ФорматПредставленияПустогоВремени = "ДП=00:00";
	
	Элементы.Результат.Видимость = Объект.Выполнена;
	Элементы.ГруппаНапоминания.Видимость = ЗначениеЗаполнено(ВремяНачала) ИЛИ ЗначениеЗаполнено(ДатаНачала);
	Если ЗначениеЗаполнено(ВремяОкончания) Тогда
		Элементы.ВремяНачала.ФорматРедактирования = ДобавитьФорматПредставленияВремени(
			Элементы.ВремяОкончания.ФорматРедактирования, "ДП", "ДП=00:00");
	Иначе
		Элементы.ВремяНачала.ФорматРедактирования = Элементы.ВремяОкончания.ФорматРедактирования;
	КонецЕсли;
	
	Элементы.ГруппаМассоваяПостановкаЗадачи.Видимость = СписокОснований.Количество() > 0;
	Элементы.ОснованиеВыборПодбор.Видимость = СписокОснований.Количество() = 0;
	Элементы.ДекорацияПодобрать.Видимость = НЕ ЗначениеЗаполнено(Объект.Основание) 
		И НЕ ЗначениеЗаполнено(Объект.ОснованиеСтроковаяСсылка);
	Элементы.ГруппаСписокОснований.Заголовок = ЗаголовокГруппыОснований();
	Элементы.Подсказка.Заголовок = ЗаголовокПодсказки();
	
	Если Элементы.ДекорацияПодобрать.Видимость Тогда
		Элементы.ОснованиеСтрокой.МаксимальнаяШирина = 10;
	Иначе
		Элементы.ОснованиеСтрокой.МаксимальнаяШирина = 36;
	КонецЕсли;
	
	Элементы.ВремяНачала.Доступность = Не Объект.ВесьДень;
	Элементы.ВремяОкончания.Доступность = Не Объект.ВесьДень;
	
	Элементы.ГруппаНайтиВремя.Видимость = НайтиВремяВидимость;
	Элементы.ДекорацияОтступНапоминания.Видимость = НЕ Элементы.ГруппаНапоминания.Видимость;
	
	Если РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый Тогда
		Элементы.СозданиеДополнительныхРеквизитов.РастягиватьПоГоризонтали = Ложь;
		Элементы.СозданиеДополнительныхРеквизитов.Ширина = 51;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатыНачалаОкончанияНаФорме(Форма)
	
	Форма.ДатаНачала = Форма.Объект.ДатаНачала;
	Форма.ВремяНачала = Форма.Объект.ДатаНачала;
	Форма.ДатаОкончания = Форма.Объект.ДатаОкончания;
	Форма.ВремяОкончания = Форма.Объект.ДатаОкончания;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатыНачалаОкончанияВОбъекте(Форма)
	
	Форма.Объект.ДатаНачала = Неопределено;
	Форма.Объект.ДатаОкончания = Неопределено;
	
	Если ЗначениеЗаполнено(Форма.ДатаНачала) Тогда
		Форма.Объект.ДатаНачала = Форма.ДатаНачала;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ВремяНачала) Тогда
		Форма.Объект.ДатаНачала = Форма.Объект.ДатаНачала + (Форма.ВремяНачала - НачалоДня(Форма.ВремяНачала));
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ДатаОкончания) Тогда
		Форма.Объект.ДатаОкончания = Форма.ДатаОкончания;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ВремяОкончания) Тогда
		Форма.Объект.ДатаОкончания = Форма.Объект.ДатаОкончания + (Форма.ВремяОкончания - НачалоДня(Форма.ВремяОкончания));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаголовокГруппыОснований()
	ПараметрыПредмета = "основания, оснований, оснований";
	ШаблонСтроки = НСтр("ru=';выбрано %1 основание;;выбрано %1 основания;выбрано %1 оснований;выбрано %1 основания'");
	СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ШаблонСтроки,СписокОснований.Количество());
	Возврат СтрокаЗаголовка;
КонецФункции

#Область ДатыЗадачи

&НаКлиенте
Процедура НачатьВыборДатыИзКалендаря()
	
	Продолжение = Новый ОписаниеОповещения("ЗаполнитьДатуЗадачиИзКалендаря", ЭтотОбъект);
	
	ПараметрыВыбораВремениЗадачи = Новый Структура;
	ПараметрыВыбораВремениЗадачи.Вставить("ТекстНовойЗадачи", Объект.Описание);
	ПараметрыВыбораВремениЗадачи.Вставить("Календарь", Объект.Календарь);
	ПараметрыВыбораВремениЗадачи.Вставить("ДатаНачала", Объект.ДатаНачала);
	ПараметрыВыбораВремениЗадачи.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборВремениЗадачи", ПараметрыВыбораВремениЗадачи);
	ПараметрыФормы.Вставить("ОписаниеНовойЗадачи", Объект);
	ОткрытьФорму("Справочник.ЗаписиКалендаряСотрудника.Форма.Календарь", ПараметрыФормы,,,,,
		Продолжение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуЗадачиИзКалендаря(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПриРедактированииСохраняемыхДанных();
	ЗаполнитьЗначенияСвойств(Объект, Результат);
	ЗаполнитьДатыНачалаОкончанияНаФорме(ЭтотОбъект);
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыборДатыНачала()
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	НачалоДня = НачалоДня(ТекущаяДатаСеанса);
	
	КонецДняВСекундах = 60 * 60 * 18;
	ДеньВСекундах = 60 * 60 * 24;
	
	ДатыДляВыбора = Новый СписокЗначений;
	ДатыДляВыбора.Добавить(НачалоДня, НСтр("ru='Сегодня'"));
	ДатыДляВыбора.Добавить(НачалоДня + КонецДняВСекундах, НСтр("ru='В конце дня'"));
	ДатыДляВыбора.Добавить(НачалоДня + ДеньВСекундах, НСтр("ru='Завтра'"));
	ДатыДляВыбора.Добавить(НачалоДня + (5 - ДеньНедели(НачалоДня)) * ДеньВСекундах, НСтр("ru='До конца недели'"));
	ДатыДляВыбора.Добавить(НачалоНедели(НачалоДня) + 7 * ДеньВСекундах, НСтр("ru='На следующей неделе'"));
	ДатыДляВыбора.Добавить(ДобавитьМесяц(НачалоДня, 1), НСтр("ru='Через месяц'"));
	
	Элементы.ДатаНачала.СписокВыбора.Очистить();
	Для каждого ДатаВыбора Из ДатыДляВыбора Цикл
		Элементы.ДатаНачала.СписокВыбора.Добавить(ДатаВыбора.Значение, ПредставлениеДаты(ДатаВыбора.Значение, ДатаВыбора.Представление));
	КонецЦикла;
	
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ВремяНачала);
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ВремяОкончания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеДаты(Дата, ДатаТекстом)
	
	ПоказатьДеньНедели = Ложь;
	ПоказатьВремя = Ложь;
	
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
		ПоказатьДеньНедели = Истина;
	КонецЕсли;
	Если Дата - НачалоДня(Дата) <> 0 Тогда
		ПоказатьВремя = Истина;
	КонецЕсли;
	
	ФорматДеньНеделиВремя = "ДФ='ддд ЧЧ:ММ'";
	ФорматДеньНедели= "ДФ='ддд'";
	ФорматВремя = "ДФ='ЧЧ:ММ'";
	
	Если ПоказатьДеньНедели И ПоказатьВремя Тогда
		ФорматДаты = "ДФ='ддд ЧЧ:ММ'";
	ИначеЕсли ПоказатьДеньНедели Тогда
		ФорматДаты = "ДФ='ддд'";
	ИначеЕсли ПоказатьВремя Тогда
		ФорматДаты = "ДФ='ЧЧ:ММ'";
	Иначе
		ФорматДаты = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФорматДаты) Тогда
		Возврат ДатаТекстом;
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='%1   <span style=""color:ЦветНедоступногоТекста"">%2</span>'");
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "ЦветНедоступногоТекста", Метаданные.ЭлементыСтиля.ЦветНедоступногоТекста.Имя);
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонСтроки, ДатаТекстом, Формат(Дата, ФорматДаты));
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииВесьДеньДляЗадачиСотрудника(ОтображатьВремяС = 9)
	
	Если Объект.ВесьДень Тогда
		РаботаСКалендаремКлиент.СкорректироватьДатуНачалаИОкончания(
			Объект.ДатаНачала, Объект.ДатаОкончания, Объект.ВесьДень,
			НачальноеЗначениеДатаНачала, НачальноеЗначениеДатаОкончания, Ложь, Истина);
			ОбновитьВремяНачалаОкончания();
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала = НачалоДня(Объект.ДатаНачала) + ОтображатьВремяС * 3600;
	Объект.ДатаОкончания = Объект.ДатаНачала + 3600;
	
	НачальноеЗначениеДатаНачала = Объект.ДатаНачала;
	НачальноеЗначениеДатаОкончания = Объект.ДатаОкончания;
	ОбновитьВремяНачалаОкончания();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВремяНачалаОкончания()
	
	ДатаНачала = НачалоДня(Объект.ДатаНачала);
	ВремяНачала = Дата(1,1,1) + (Объект.ДатаНачала - НачалоДня(Объект.ДатаНачала));
	ДатаОкончания = НачалоДня(Объект.ДатаОкончания);
	ВремяОкончания = Дата(1,1,1) + (Объект.ДатаОкончания - НачалоДня(Объект.ДатаОкончания));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПродолжительности(Форма)
	
	Форма.ПредставлениеПродолжительности = "";
	
	Начало = Форма.Объект.ДатаНачала;
	
	Если Форма.Объект.ДатаОкончания = КонецДня(Форма.Объект.ДатаОкончания) Тогда
		Окончание = Форма.Объект.ДатаОкончания + 1;
	Иначе
		Окончание = Форма.Объект.ДатаОкончания;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Начало)
		Или Не ЗначениеЗаполнено(Окончание) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДлительностьСек = Окончание - Начало;
	
	Дней = Цел(ДлительностьСек / 86400);
	ПодписьДней = СтрокаСЧислом(НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'"), Дней,
		ВидЧисловогоЗначения.Количественное);
	
	Часов = Цел((ДлительностьСек - Дней * 86400) / 3600);
	ПодписьЧасов = СтрокаСЧислом(НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'"), Часов,
		ВидЧисловогоЗначения.Количественное);

	Минут = Цел((ДлительностьСек - Дней * 86400 - Часов * 3600) / 60);
	ПодписьМинут = СтрокаСЧислом(НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минуты'"), Минут,
		ВидЧисловогоЗначения.Количественное);
	
	Если Дней > 0 Тогда 
		Форма.ПредставлениеПродолжительности = Форма.ПредставлениеПродолжительности + ПодписьДней;
	КонецЕсли;
	
	Если Часов > 0 Тогда 
		
		Если Дней > 0 Тогда
			Форма.ПредставлениеПродолжительности = Форма.ПредставлениеПродолжительности + " ";
		КонецЕсли;
		
		Форма.ПредставлениеПродолжительности = Форма.ПредставлениеПродолжительности + ПодписьЧасов;
	КонецЕсли;
	
	Если Минут > 0 Тогда 
		
		Если Дней > 0 Или Часов > 0 Тогда
			Форма.ПредставлениеПродолжительности = Форма.ПредставлениеПродолжительности + " ";
		КонецЕсли;
		
		Форма.ПредставлениеПродолжительности = Форма.ПредставлениеПродолжительности + ПодписьМинут;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОснованиеЗадачи

&НаСервере
Процедура ЗаполнитьСписокОснований()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.ЗначенияЗаполнения.Свойство("Основание") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ЗначенияЗаполнения.Основание) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ОснованиеЗадачи Из Параметры.ЗначенияЗаполнения.Основание Цикл
		НоваяСтрока = СписокОснований.Добавить();
		НоваяСтрока.Основание = ОснованиеЗадачи.Ссылка;
		Объект.Основание = ОснованиеЗадачи;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыОснованийЗадачи()
	
	ТипыОснованийЗадачи = ЗадачиСотрудника.ДоступныеТипыМенюВыбораОснования();

	Возврат ТипыОснованийЗадачи;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаСтрокиОткрытьОбъект()
	
	Возврат "Открыть";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаСтрокиВыбратьОбъект()
	
	Возврат "Выбрать";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГиперссылкаСтрокиОчиститьОбъект()
	
	Возврат "Очистить";
	
КонецФункции

&НаКлиенте
Процедура ОснованиеСтрокойОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = ГиперссылкаСтрокиОткрытьОбъект() Тогда
		ОткрытьОснованиеЗадачи();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = ГиперссылкаСтрокиВыбратьОбъект() Тогда
		ВыбратьТипОснованияЗадачиИзСписка();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = ГиперссылкаСтрокиОчиститьОбъект() Тогда
		ОчиститьОснованиеЗадачи();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОснованиеЗадачи()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ПоказатьЗначение(, Объект.Основание);
	Иначе
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Объект.ОснованиеСтроковаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипОснованияЗадачиИзСписка(МножественныйВыбор = Ложь)
	
	ЭлементОснования = ?(МножественныйВыбор, Элементы.ДекорацияПодобрать, Элементы.ОснованиеСтрокой);
	
	Продолжение = Новый ОписаниеОповещения("ПослеВыбораТипаОснованияЗадачи", ЭтотОбъект, МножественныйВыбор);
	ПоказатьВыборИзМеню(Продолжение, ТипыОснованийЗадачи(), ЭлементОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипОснованияЗадачиИзФормы(МножественныйВыбор = Ложь)
	
	Продолжение = Новый ОписаниеОповещения("ПослеВыбораТипаОснованияЗадачи", ЭтотОбъект, МножественныйВыбор);
	ОткрытьФорму("Документ.ЗадачаСотрудника.Форма.ВыборТипаОснования",, ЭтотОбъект,,,, Продолжение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаОснованияЗадачи(ТипОснования, ДополнительныеПараметры) Экспорт
	
	Если ТипОснования = Неопределено Или ТипОснования = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОснования.Значение = "ПоказатьВсе" Тогда
		ВыбратьТипОснованияЗадачиИзФормы(ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ВыбратьОснованиеЗадачи(ТипОснования.Значение, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолноеИмяМетаданного(Тип)
	
	Возврат Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
	
КонецФункции

&НаКлиенте
Процедура ВыбратьОснованиеЗадачи(ТипОснования, МножественныйВыбор = Ложь)
	
	ПолноеИмяМетаданного = ПолноеИмяМетаданного(ТипОснования);
	
	Продолжение = Новый ОписаниеОповещения("ЗаполнитьВыбранноеОснованиеЗадачи", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Если МножественныйВыбор Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяМетаданного + ".ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , Продолжение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВыбранноеОснованиеЗадачиВОбъекте(Объект, ВыбранноеОснование, ОснованиеПредставление = "")
	
	Если ТипЗнч(ВыбранноеОснование) = Тип("Строка") Тогда
		Объект.Основание = Неопределено;
		Объект.ОснованиеСтроковаяСсылка = ВыбранноеОснование;
		Объект.ОснованиеПредставление = ОснованиеПредставление;
	Иначе
		Объект.Основание = ВыбранноеОснование;
		Объект.ОснованиеСтроковаяСсылка = Неопределено;
		Объект.ОснованиеПредставление = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранноеОснованиеЗадачи(ВыбранноеОснование, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеОснование = Неопределено Тогда
		УправлениеФормой();
		Возврат;
	КонецЕсли;
	
	ПриРедактированииСохраняемыхДанных();
	ЗаполнитьВыбранноеОснованиеЗадачиВОбъекте(Объект, ВыбранноеОснование);
	ЗаполнитьОснованиеНаФорме();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОснованиеЗадачи()
	
	ПриРедактированииСохраняемыхДанных();
	
	Объект.Основание = Неопределено;
	Объект.ОснованиеПредставление = Неопределено;
	Объект.ОснованиеСтроковаяСсылка = Неопределено;
	
	ЗаполнитьОснованиеНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОснованиеНаФорме()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ПредставлениеОснования = ПредставлениеЗаполненногоОснованияСсылкой();
	ИначеЕсли ЗначениеЗаполнено(Объект.ОснованиеСтроковаяСсылка) Тогда
		ПредставлениеОснования = ПредставлениеЗаполненногоОснованияСтрокой();
	Иначе
		ПредставлениеОснования = ПредставлениеНезаполненногоОснования();
	КонецЕсли;
	
	ОснованиеСтрокой = ПредставлениеОснования.Представление;
	Элементы.ОснованиеСтрокой.Подсказка = ПредставлениеОснования.Подсказка;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КороткоеПредставлениеСтроки(Знач ИсходнаяСтрока)
	
	ОграничениеДлиныСтроки = 45;
	
	Если СтрДлина(ИсходнаяСтрока) < ОграничениеДлиныСтроки Тогда
		Возврат ИсходнаяСтрока;
	КонецЕсли;
	
	Возврат СтрШаблон("%1%2", Лев(ИсходнаяСтрока, ОграничениеДлиныСтроки), "...");
	
КонецФункции

&НаКлиенте
Функция ПредставлениеЗаполненногоОснованияСсылкой()
	
	ПредставлениеСсылки = Строка(Объект.Основание);
	
	Возврат ПредставлениеЗаполненногоОснования(ПредставлениеСсылки);
	
КонецФункции

&НаКлиенте
Функция ПредставлениеЗаполненногоОснованияСтрокой()
	
	Если ЗначениеЗаполнено(Объект.ОснованиеПредставление) Тогда
		ПредставлениеСсылки = Объект.ОснованиеПредставление;
	Иначе
		ПредставлениеСсылки = Объект.ОснованиеСтроковаяСсылка;
	КонецЕсли;
	
	Возврат ПредставлениеЗаполненногоОснования(ПредставлениеСсылки);
	
КонецФункции

&НаКлиенте
Функция ПредставлениеЗаполненногоОснования(ПредставлениеСсылки)
	
	КороткоеПредставлениеСсылки = КороткоеПредставлениеСтроки(ПредставлениеСсылки);
	Если ПредставлениеСсылки <> КороткоеПредставлениеСсылки Тогда
		Подсказка = ПредставлениеСсылки;
	Иначе
		Подсказка = "";
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='<a href = ""ГиперссылкаСтрокиОткрытьОбъект"">%1</a> <a href = ""ГиперссылкаСтрокиОчиститьОбъект""><img src=""ОчиститьЗначение12х12""></a>'");
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "ГиперссылкаСтрокиОткрытьОбъект", ГиперссылкаСтрокиОткрытьОбъект());
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "ГиперссылкаСтрокиОчиститьОбъект", ГиперссылкаСтрокиОчиститьОбъект());
	ПредставлениеОснования = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ШаблонСтроки, КороткоеПредставлениеСсылки);
	
	Результат = Новый Структура;
	Результат.Вставить("Представление", ПредставлениеОснования);
	Результат.Вставить("Подсказка", Подсказка);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеНезаполненногоОснования()
	
	Представление = Новый ФорматированнаяСтрока(НСтр("ru='Выбрать'"),,,, ГиперссылкаСтрокиВыбратьОбъект());
	
	Результат = Новый Структура;
	Результат.Вставить("Представление", Представление);
	Результат.Вставить("Подсказка", "");
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВыборОтветственногоИзОснования()
	
	Если НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственныйОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "Ответственный");
	Если НЕ ЗначениеЗаполнено(ОтветственныйОснования) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОснования = Объект.Основание.Метаданные();
	Если ЗначениеЗаполнено(МетаданныеОснования.ПредставлениеОбъекта) Тогда
		ПредставлениеОбъекта = МетаданныеОснования.ПредставлениеОбъекта;
	Иначе
		ПредставлениеОбъекта = МетаданныеОснования.Синоним;
	КонецЕсли;
	
	ПредставлениеОтветственногоОснования = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru='%1 <span style=""color:РезультатУспехЦвет"">(ответственный за %2)</span>'"),
		Строка(ОтветственныйОснования),
		ПредставлениеОбъекта);
	Элементы.Ответственный.СписокВыбора.Добавить(ОтветственныйОснования, ПредставлениеОтветственногоОснования);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ЗаголовокПодсказки()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат НСтр("ru = 'задача будет создана для каждого основания отдельно'");
	Иначе
		Возврат НСтр("ru = 'задача будет изменена для каждого основания отдельно'");
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьКолонкуКалендаря()
	Объект.КолонкаКалендаря = Справочники.КолонкиКалендарейСотрудников.КолонкаНеобработанное(Объект.Календарь);
КонецПроцедуры

&НаСервере
Процедура ПолеВводаТегаОкончаниеВводаТекстаСервер(Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТегированиеОбъектов.ПолеВводаТегаОкончаниеВводаТекста(ЭтотОбъект, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПолеВводаТегаОбработкаВыбораСервер(ИмяЭлемента, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТегированиеОбъектов.ПолеВводаТегаОбработкаВыбора(ЭтотОбъект, ИмяЭлемента, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОблакоТеговОбработкаНавигационнойСсылкиСервер(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
	ТегированиеОбъектов.ОблакоТеговОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриРедактированииСохраняемыхДанных()
	
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьФорматПредставленияВремени(ТекущийФормат, ПараметрФормата, ЗначениеФормата)
	
	Если СтрНайти(ТекущийФормат, СтрШаблон("%1=", ПараметрФормата)) <> 0 Тогда
		Возврат ТекущийФормат;
	КонецЕсли;
	
	НоваяСтрокаФормата = ТекущийФормат;
	НоваяСтрокаФормата = СокрЛП(НоваяСтрокаФормата);
	
	Если НЕ СтрЗаканчиваетсяНа(НоваяСтрокаФормата, ";") Тогда
		РазделительЗначений = "; ";
	Иначе
		РазделительЗначений = "";
	КонецЕсли;
	
	НоваяСтрокаФормата = СтрШаблон("%1%2%3", НоваяСтрокаФормата, РазделительЗначений, ЗначениеФормата);
	
	Возврат НоваяСтрокаФормата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКалендарьПоОтветственному()
	
	КалендариСотрудника = Справочники.КалендариСотрудников.ДоступныеСотрудникуКалендари(Объект.Ответственный);
	ТекущийКалендарьДоступенСотруднику = КалендариСотрудника.Найти(Объект.Календарь, "Календарь") <> Неопределено;
	
	Если ТекущийКалендарьДоступенСотруднику Тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеКалендариСотрудников = Справочники.КалендариСотрудников.ОсновныеКалендариСотрудников();
	Объект.Календарь = ОсновныеКалендариСотрудников.Получить(Объект.Ответственный);
	Объект.КолонкаКалендаря = Справочники.КолонкиКалендарейСотрудников.КолонкаНеобработанное(Объект.Календарь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВремени()
	Если ДатаНачала = ДатаОкончания И ВремяНачала = Дата("00010101000000") И ВремяОкончания = Дата("00010101000000") Тогда
		ДатаОкончания = Дата("00010101000000");
		ЗаполнитьДатыНачалаОкончанияВОбъекте(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НапоминанияПриСозданииНаСервере()
	
	Если Элементы.ГруппаНапоминания.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСПолемНапоминания = Элементы.ГруппаНапоминания.ПодчиненныеЭлементы[0];
	ГруппаСПолемНапоминания.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ПолеИнтервалНапоминания = Неопределено;
	Для каждого ЭлементФормы Из ГруппаСПолемНапоминания.ПодчиненныеЭлементы Цикл
		Если ЭлементФормы.Имя = "ИнтервалВремениНапоминания" Тогда
			ПолеИнтервалНапоминания = ЭлементФормы;
		КонецЕсли;
	КонецЦикла;
	
	Если ПолеИнтервалНапоминания <> Неопределено Тогда
		ПолеИнтервалНапоминания.Ширина = 9;
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.НапоминанияПользователя
&НаКлиенте
Процедура Подключаемый_ПриИзмененииНастройкиНапоминания(Элемент)
	НапоминанияПользователяКлиент.ПриИзмененииНастройкиНапоминания(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.НапоминанияПользователя

// СтандартныеПодсистемы.ПодключаемыеКоманды

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
